xml/InformationRegisters/ИИА_СтатусИндексаRAG.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_СтатусИндексаRAG</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/CommonForms/ИИА_RAG/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСтатусИндекса();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	
	Если ПустаяСтрока(Запрос) Тогда
		Возврат;
	КонецЕсли;
	
	НайтиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НайтиНаСервере()
	
	КонтекстПоиска = Новый Структура;
	// Здесь можно добавить текущий объект, если форма вызывается в контексте
	
	РезультатыПоиска.Загрузить(ИИА_RAG_Поиск.ВыполнитьПоиск(Запрос, 20, КонтекстПоиска));
	
КонецПроцедуры

&НаКлиенте
Процедура ПерестроитьИндекс(Команда)
	
	ПерестроитьИндексНаСервере();
	ОбновитьСтатусИндекса();
	
	ПоказатьПредупреждение(, "Индекс успешно перестроен");
	
КонецПроцедуры

&НаСервере
Процедура ПерестроитьИндексНаСервере()
	
	ИИА_RAG_Индексатор.ПерестроитьИндекс();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусИндекса()
	
	ЗапросСтатус = Новый Запрос(
	"ВЫБРАТЬ
	|	ИИА_СтатусИндексаRAG.ДатаСборки КАК ДатаСборки,
	|	ИИА_СтатусИндексаRAG.ВерсияКонфигурации КАК ВерсияКонфигурации
	|ИЗ
	|	РегистрСведений.ИИА_СтатусИндексаRAG КАК ИИА_СтатусИндексаRAG");
	
	Выполнение = ЗапросСтатус.Выполнить();
	Если Не Выполнение.Пустой() Тогда
		Выборка = Выполнение.Выбрать();
		Выборка.Следующий();
		СтатусИндекса = СтрШаблон("Индекс собран: %1 (Версия: %2)", Выборка.ДатаСборки, Выборка.ВерсияКонфигурации);
	Иначе
		СтатусИндекса = "Индекс не собран";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПоискаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		КарточкаКонтекста = "";
		Возврат;
	КонецЕсли;
	
	ОбновитьКарточку(ТекущиеДанные.КлючЧанка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКарточку(КлючЧанка)
	
	ДанныеКонтекста = ИИА_RAG_Поиск.ПолучитьКонтекст(КлючЧанка);
	Если ДанныеКонтекста <> Неопределено Тогда
		КарточкаКонтекста = "=== " + ДанныеКонтекста.Заголовок + " ===" + Символы.ПС + Символы.ПС
			+ "Путь: " + ДанныеКонтекста.Путь + Символы.ПС + Символы.ПС
			+ "Текст чанка:" + Символы.ПС
			+ ДанныеКонтекста.Текст;
	Иначе
		КарточкаКонтекста = "";
	КонецЕсли;
	
КонецПроцедуры
